---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetName
source: html/10afd620-8b8f-63d2-5079-31c5d0f6e7c8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.MechanicalEquipmentSetName Property

"Name"

## Syntax (C#)
```csharp
public static ForgeTypeId MechanicalEquipmentSetName { get; }
```